<?php
/**
 * Date: 17.07.18
 * @author Isaenko Alexey <info@oiplug.com>
 */

?>

<div class="content">Контент - О нас</div>
<ul>
	<li> Необходимо определить первую цифру числа следующим способом:
		<ul>
			<li>Получить число знаков числа</li>
			<li>Разделить на 10 в степени n, где n = число знаков минус 1</li>
			<li>отбросить дробную часть</li>
		</ul>
	</li>
	<li>задача в functions:41</li>
	<li>Сделать функцию, которая принимает в качестве параметра строку, которая является путем к файлу, который надо
		подключить и подключает его
		<code>get_template('templates/bio');</code>
	</li>
</ul>
